renesas/rx72n-envision-kit/projects/renesas/rx72n_envision_kit/e2studio/boot_loader/src/smc_gen/r_flash_rx/src/r_flash_fcu.c
    p_src = (uint8_t*) FCU_FIRMWARE_STORAGE_AREA;
    p_dest = (uint8_t*) FCU_RAM_AREA;

    if (FLASH.FENTRYR.WORD != 0x0000)
    {
        /*Enter Read Mode*/
        FLASH.FENTRYR.WORD = 0xAA00;

        /* Initialize timeout for FENTRYR being written. */
        wait_cnt = FLASH_FENTRYR_TIMEOUT;

        /* Read FENTRYR to ensure it has been set to 0. Note that the top byte
           of the FENTRYR register is not retained and is read as 0x00. */
        while (0x0000 != FLASH.FENTRYR.WORD)
        {
            /* Wait until FENTRYR is 0 unless timeout occurs. */
            if (wait_cnt-- <= 0)
            {
                return FLASH_ERR_TIMEOUT;
            }
        }
    }

    FLASH.FCURAME.WORD = 0xC403;      // FCURAM Access Enabled, High Speed Write Enabled

    /* Copy over the 4K from storage area to FCURAM */
    memcpy(p_dest, p_src, FCU_RAM_SIZE);

    FLASH.FCURAME.WORD = 0xC400;      // FCURAM Access Disabled


    /* Clear the ECC error flag in FCURAM */
    err = flash_pe_mode_enter(FLASH_TYPE_CODE_FLASH);
    if (err == FLASH_SUCCESS)
    {
        err = flash_stop();
        if (err == FLASH_SUCCESS)
        {
            err = flash_pe_mode_exit();
        }
    }

    return err;
}
#endif // FLASH_HAS_FCU_RAM_ENABLE


#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)
#define FLASH_PE_MODE_SECTION    R_BSP_ATTRIB_SECTION_CHANGE(P, FRAM)
#define FLASH_SECTION_CHANGE_END R_BSP_ATTRIB_SECTION_CHANGE_END
#else
#define FLASH_PE_MODE_SECTION
#define FLASH_SECTION_CHANGE_END
#endif


/***********************************************************************************************************************
 * Function Name: flash_reset
 * Description  : Function resets the Flash peripheral
 ** Arguments   : None
 * Return Value : FLASH_SUCCESS -
 *                Flash Peripheral successfully reset.
 * Notes     :   -This function will reset the peripheral by stopping any ongoing operations,
 *                clearing the DFAE and CFAE flags and changing the PE mode to Read mode.
 ***********************************************************************************************************************/
FLASH_PE_MODE_SECTION
flash_err_t flash_reset(void)
{

    /* Cannot release sequencer from the command-locked state with status clear
     * or forced-stop commands if CFAE or DFAE is set. Must read those bits
     * before can set to 0.
     */
    if (FLASH.FASTAT.BIT.CFAE == 1)
    {
        FLASH.FASTAT.BIT.CFAE = 0;
    }
#ifndef FLASH_NO_DATA_FLASH
    if (FLASH.FASTAT.BIT.DFAE == 1)
    {
        FLASH.FASTAT.BIT.DFAE = 0;
    }
#endif

    /* Possible FLASH_CMD_RESET is called when no outstanding command is in progress.
     * In that case, enter pe mode so flash_stop() can write to the sequencer.
     */
    if (g_flash_state == FLASH_READY)
    {
        flash_pe_mode_enter(FLASH_TYPE_CODE_FLASH);
    }

    /*Issue a forced stop */
    flash_stop();

    /*Transition to Read mode*/
    FLASH.FENTRYR.WORD = 0xAA00;
    while (FLASH.FENTRYR.WORD != 0x0000)
        ;

    return FLASH_SUCCESS;
}


/***********************************************************************************************************************
 * Function Name: flash_stop
 * Description  : Function issue the STOP command and check the state of the Command Lock bit.
 * Arguments    : none
 * Return Value : FLASH_SUCCESS -
 *                    Stop issued successfully.
 *                FLASH_ERR_LOCKED
 *                    Peripheral in locked state
 ***********************************************************************************************************************/
FLASH_PE_MODE_SECTION
flash_err_t flash_stop(void)
{

    g_current_parameters.current_operation = FLASH_CUR_STOP;

    /* Issue stop command to flash command area */
    *g_pfcu_cmd_area = (uint8_t) FLASH_FACI_CMD_FORCED_STOP;

    /* Wait for current operation to complete.*/
    while (1 != FLASH.FSTATR.BIT.FRDY)
    {
        ;
    }

    /* Check that fcu command lock bit is cleared */
    if (0 != FLASH.FASTAT.BIT.CMDLK)
    {
        return FLASH_ERR_CMD_LOCKED;
    }

    return FLASH_SUCCESS;
}


/***********************************************************************************************************************
 * Function Name: flash_pe_mode_enter
 * Description  : Function switches the peripheral to P/E mode for Code Flash or Data Flash.
 * Arguments    : flash_type_t : Specify Code Flash or Data Flash
 * Return Value : FLASH_SUCCESS -
 *                Switched successfully.
 *                FLASH_ERR_FAILURE -
 *                Unable to Switch to P/E Mode.
 *                FLASH_ERR_PARAM -
 *                Illegal parameter passed
 * NOTE         : This function must run from RAM if Code Flash non-BGO is used
 ***********************************************************************************************************************/
FLASH_PE_MODE_SECTION
flash_err_t flash_pe_mode_enter(flash_type_t flash_type)
{
    flash_err_t err = FLASH_SUCCESS;

    if (flash_type == FLASH_TYPE_DATA_FLASH)
    {
        FLASH.FENTRYR.WORD = 0xAA80;        //Transition to DF P/E mode
#if (FLASH_TYPE == 4)
        while (FLASH.FENTRYR.WORD != 0x0080)
            ;
#endif

        if (FLASH.FENTRYR.WORD == 0x0080)
        {
            err = FLASH_SUCCESS;
        }
        else
        {
            err = FLASH_ERR_FAILURE;
        }
    }

    /* WARNING! Do not #if this out when CF is not enabled. Needed for flash_reset() on parts with no DF. */
    else if (flash_type == FLASH_TYPE_CODE_FLASH)
    {
        FLASH.FENTRYR.WORD = 0xAA01;            //Transition to CF P/E mode
#if (FLASH_TYPE == 4)
        while (FLASH.FENTRYR.WORD != 0x0001)
            ;
#endif

        if (FLASH.FENTRYR.WORD == 0x0001)
        {
            err = FLASH_SUCCESS;
#ifdef FLASH_HAS_SEQUENTIAL_CF_BLOCKS_LOCK
            if (g_lkbit_mode == FLASH_LOCKBIT_MODE_OVERRIDE)
            {
                FLASH.FPROTR.WORD = 0x5501;
            }
#endif
        }
        else
        {
            err = FLASH_ERR_FAILURE;
        }
    }
    else
    {
        err = FLASH_ERR_PARAM;
    }

